app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt") VALUES ('Quad Quadland', 'quad@quadland.com', '2011-06-12 15:45:42.857892', '2011-06-12 15:45:42.857892', '4849bdb4ecb5d7bf24153f321e17da6c3d8533ab03fee3a3ec6c7e7d689dc750', '7ac951a8479e1fb30b4e9118b6041e7171139bde8996605d3cac5ae7c206ad4b')